# Install fonts so that everything looks amazing
cask "font-fantasque-sans-mono"
cask "font-fantasque-sans-mono-nerd-font"

# 1password
tap "1password/tap"
cask "1password-cli"
cask "1password"
mas "1Password for Safari", id: 1569813296

# Other Taps
tap "homebrew/services"

# Install a bunch of packages
# TODO: Add some grouping
brew "zstd"
brew "llvm"
brew "aria2"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "pkg-config"
brew "direnv"
brew "libsodium"
brew "harfbuzz"
brew "libksba"
brew "gnupg"
brew "libtool"
brew "gdal"
brew "gobject-introspection"
brew "htop"
brew "libffi"
brew "imagemagick"
brew "jq"
brew "libressl"
brew "lima"
brew "lsusb"
brew "mas"
brew "zlib"
brew "nmap"
brew "tmux"
brew "overmind"
brew "poppler-qt5"
brew "pwgen"
brew "rsync"
brew "ssh-copy-id"
brew "terminal-notifier"
brew "tig"
brew "tree"
brew "watchman"
brew "wget"

# Media tools
brew "yt-dlp"
# brew "gstreamer"
# brew "ffmpeg"

# Git tools
brew "gh"
brew "git"
brew "git-crypt"
brew "gitui"

# Network utilities
brew "ipcalc"
brew "speedtest-cli"

# ZSH and plugins
brew "zsh"
brew "zplug"

# Editors
brew "neovim"
brew "rg"
brew "fd"
brew "lazygit"
cask "neovide"

# Programming languages
brew "node"
brew "yarn"
brew "nvm"
# brew "crystal"
brew "rbenv"
brew "ruby-build"

# Build depencencies for Rubye
brew "openssl@3"
brew "readline"
brew "libyaml"
brew "gmp"

# Database tools for development
# brew "redis", restart_service: true
# brew "mysql", restart_service: true

# Postgres
# brew "postgresql@16", restart_service: true
# brew "geos"
# brew "proj"
# tap "timescale/tap"
# brew "timescale/tap/timescaledb"
# brew "libpq", link: true
# brew "check_postgres"
# brew "postgis"

# GUI Apps
cask "elgato-stream-deck"
cask "monitorcontrol"
cask "tidal"
cask "vlc"
# cask "postico"
cask "iterm2"
cask "flameshot"
cask "Slack"
cask "Alfred"

# Mac App Store Applications
mas "Apple Configurator", id: 1037126344
mas "Dato", id: 1470584107
mas "GIPHY CAPTURE", id: 668208984
# mas "Sequel Ace", id: 1518036000
# mas "Tailscale", id: 1475387142
# mas "AusweisApp", id: 948660805

# Only install Xcode when not running beta version, because we need the beta
if OS.mac? && MacOS.version < 15
  mas "Xcode", id: 497799835
end

# Apps have been removed from the store
# mas "Skitch", id: 425955336
# mas "ForkLift", id: 412448059
# mas "Marked", id: 448925439

# VS Code extensions
# vscode "crystal-lang-tools.crystal-lang"
# vscode "cschlosser.doxdocgen"
# vscode "esbenp.prettier-vscode"
# vscode "github.vscode-github-actions"
# vscode "itarato.byesig"
# vscode "jeff-hykin.better-cpp-syntax"
# vscode "karunamurti.haml"
# vscode "koichisasada.vscode-rdbg"
# vscode "matthewmcgarvey.crystal-spec-vscode"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-ceintl.vscode-language-pack-de"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode.cmake-tools"
# vscode "ms-vscode.cpptools"
# vscode "ms-vscode.cpptools-extension-pack"
# vscode "ms-vscode.cpptools-themes"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.theme-tomorrowkit"
# vscode "pkief.material-icon-theme"
# vscode "platformio.platformio-ide"
# vscode "redhat.vscode-yaml"
# vscode "shopify.ruby-extensions-pack"
# vscode "shopify.ruby-lsp"
# vscode "shopify.vscode-shadowenv"
# vscode "sorbet.sorbet-vscode-extension"
# vscode "tamasfe.even-better-toml"
# vscode "twxs.cmake"
# vscode "vscodevim.vim"
